### Data source - https://www.kaggle.com/datasets/jimschacko/airlines-dataset-to-predict-a-delay?resource=download

In [57]:
import pandas as

### creating dataframes

In [3]:
data = [['sourabha1',10],
        ['sourabh2',20],
        ['sourabh3',30]]
df=pd.DataFrame(data=data,index=[100,101,102],columns=["name",'age'],dtype=object)
print(df)

          name age
100  sourabha1  10
101   sourabh2  20
102   sourabh3  30

In [3]:
data = {
    'Name':['Sourabh1','Sourabh2','Sourabh3'],
    'age':[10,20,30]
}
df=pd.DataFrame(data)
print(df)

       Name  age
0  Sourabh1   10
1  Sourabh2   20
2  Sourabh3   30

## dataframe merge and join and concat

Both join and merge can be used to combines two dataframes but the join method combines two dataframes on the basis of their indexes whereas the merge method is more versatile and allows us to specify columns beside the index to join on for both dataframes.

In [4]:
list('01')

['0', '1']

In [43]:
left = pd.DataFrame([['sourabh', 1], ['vivek', 2]],  # data
                    list([0,1]), # index
                    list(['name','emp_id']) # columns
                   )
print(left)
right = pd.DataFrame([['IT', 1], ['SALES', 2]],
                     list([0,1]), 
                     list(['dept','emp_id']))
print(right)

      name  emp_id
0  sourabh       1
1    vivek       2
    dept  emp_id
0     IT       1
1  SALES       2

In [26]:
left.dtypes

name      object
emp_id     int64
dtype: object

## JOIN

In [28]:
joined_df = left.join(right,lsuffix='_',rsuffix='_')
joined_df

      name  emp_id_   dept  emp_id_
0  sourabh        1     IT        1
1    vivek        2  SALES        2

In [62]:
right.rename(columns = {'employee_id':'emp_id'},inplace =True)

In [63]:
right

    dept  emp_id
0     IT       1
1  SALES       2

In [65]:
merged_df = left.merge(right,
                       left_on = 'emp_id',
                       right_on = 'emp_id',
                      how = 'outer'
                      )

merged_df

      name  emp_id   dept
0  sourabh       1     IT
1    vivek       2  SALES

In [49]:
left

      name  emp_id
0  sourabh       1
1    vivek       2

In [50]:
right

    dept  emp_id
0     IT       1
1  SALES       2

In [52]:
    pd.concat([left,right],sort = False,join ="outer")

      name  emp_id   dept
0  sourabh       1    NaN
1    vivek       2    NaN
0      NaN       1     IT
1      NaN       2  SALES

# join strings

In [54]:
s1="Tutorials"
s2="Point"
s3="".join([s1,s2])
s4=" ".join([s1,s2])
print(s3)
print(s4)

TutorialsPoint
Tutorials Point

In [55]:
s0 = 'hello'
s1="Tutorials"
s2="Point"

s3="{}{}{}".format(s1,s2,s0)
s4="{} {} {}".format(s1,s2,s0)
print(s3)
print(s4)

TutorialsPointhello
Tutorials Point hello

# convert a string in date fromat

In [66]:
from datetime import datetime

In [67]:
date_time_str = '09/18/19 01:55:19'
print(date_time_str)
print(type(date_time_str))
date_time_str = datetime.strptime(date_time_str, '%m/%d/%y %H:%M:%S')
print(date_time_str)
print(type(date_time_str))

09/18/19 01:55:19
<class 'str'>
2019-09-18 01:55:19
<class 'datetime.datetime'>

## handle missing values/na values

## to remember -  
isnull and isna both are same. As a best practice, always prefer to use isna() over isnull().

It is easy to remember what isna() is doing because when you look at numpy method np.isnan(), it checks NaN values. In pandas there are other similar method names like dropna(), fillna() that handles missing values and it always helps to remember easily.

In [68]:
df = pd.DataFrame([['ant', 'bee', 'cat'], ['dog', None, 'fly']])
df

     0     1    2
0  ant   bee  cat
1  dog  None  fly

In [69]:
df.isna()

       0      1      2
0  False  False  False
1  False   True  False

In [215]:
df.isnull()

       0      1      2
0  False  False  False
1  False   True  False

In [216]:
df.fillna('hellooo')

     0        1    2
0  ant      bee  cat
1  dog  hellooo  fly

In [218]:
df.dropna()

     0    1    2
0  ant  bee  cat

In [219]:
df

     0     1    2
0  ant   bee  cat
1  dog  None  fly

# running sum

In [70]:
data = {
    'pname':['laptop',	'mobile'	,'tire',	'windshild',	'headlight',	'table',	'chair',	'bat',	'ball'],
    'p_category': ['electronic'	,'electronic',	'auto'	,'auto'	,'auto',	'office',	'office',	'sports'	,'sports'],
    'price':[800	,500	,400	,300,	100,	80,	90,	200,	40]
}

df=pd.DataFrame(data)
df

       pname  p_category  price
0     laptop  electronic    800
1     mobile  electronic    500
2       tire        auto    400
3  windshild        auto    300
4  headlight        auto    100
5      table      office     80
6      chair      office     90
7        bat      sports    200
8       ball      sports     40

In [71]:
df['RunningTotal'] = 1
df

       pname  p_category  price  RunningTotal
0     laptop  electronic    800             1
1     mobile  electronic    500             1
2       tire        auto    400             1
3  windshild        auto    300             1
4  headlight        auto    100             1
5      table      office     80             1
6      chair      office     90             1
7        bat      sports    200             1
8       ball      sports     40             1

In [72]:
df.drop('RunningTotal',axis = 1,inplace = True)
df

       pname  p_category  price
0     laptop  electronic    800
1     mobile  electronic    500
2       tire        auto    400
3  windshild        auto    300
4  headlight        auto    100
5      table      office     80
6      chair      office     90
7        bat      sports    200
8       ball      sports     40

In [73]:
df['RunningTotal'] = df['price'].cumsum()
df

       pname  p_category  price  RunningTotal
0     laptop  electronic    800           800
1     mobile  electronic    500          1300
2       tire        auto    400          1700
3  windshild        auto    300          2000
4  headlight        auto    100          2100
5      table      office     80          2180
6      chair      office     90          2270
7        bat      sports    200          2470
8       ball      sports     40          2510

In [51]:
df.loc[0:4][['pname','price']]

       pname  price
0     laptop    800
1     mobile    500
2       tire    400
3  windshild    300
4  headlight    100

In [52]:
df.iloc[0:4][['pname','price']]

       pname  price
0     laptop    800
1     mobile    500
2       tire    400
3  windshild    300

In [60]:
df.iloc[3:5][['pname','price']]

       pname  price
3  windshild    300
4  headlight    100

In [74]:
# creating a sample dataframe
df = pd.DataFrame({'Brand': ['Maruti', 'Hyundai', 'Tata',
                               'Mahindra', 'Maruti', 'Hyundai',
                               'Renault', 'Tata', 'Maruti'],
                     'Year': [2012, 2014, 2011, 2015, 2012,
                              2016, 2014, 2018, 2019],
                     'Kms_Driven': [50000, 30000, 60000,
                                    25000, 10000, 46000,
                                    31000, 15000, 12000],
                     'City': ['Gurgaon', 'Delhi', 'Mumbai',
                              'Delhi', 'Mumbai', 'Delhi',
                              'Mumbai', 'Chennai',  'Ghaziabad'],
                     'Mileage':  [28, 27, 25, 26, 28,
                                  29, 24, 21, 24]})

In [75]:
df

      Brand  Year  Kms_Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

## select few columns from dataframe

In [76]:
df[['Brand','Year']]

      Brand  Year
0    Maruti  2012
1   Hyundai  2014
2      Tata  2011
3  Mahindra  2015
4    Maruti  2012
5   Hyundai  2016
6   Renault  2014
7      Tata  2018
8    Maruti  2019

## select few rows from dataframe

In [77]:
df.loc[:3] # loc will include last row from result

      Brand  Year  Kms_Driven     City  Mileage
0    Maruti  2012       50000  Gurgaon       28
1   Hyundai  2014       30000    Delhi       27
2      Tata  2011       60000   Mumbai       25
3  Mahindra  2015       25000    Delhi       26

In [78]:
df.iloc[:3] # loc will exclude last row from result

     Brand  Year  Kms_Driven     City  Mileage
0   Maruti  2012       50000  Gurgaon       28
1  Hyundai  2014       30000    Delhi       27
2     Tata  2011       60000   Mumbai       25

## filter data based on given condition

In [79]:
df[(df['Year']==2014) & (df['Kms_Driven']>30000)]

     Brand  Year  Kms_Driven    City  Mileage
6  Renault  2014       31000  Mumbai       24

## # selecting cars with brand 'Maruti' and Mileage > 25

In [80]:
df[(df['Brand']=='Maruti') & (df['Mileage']>25)]

    Brand  Year  Kms_Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
4  Maruti  2012       10000   Mumbai       28

In [81]:
df.loc[(df.Brand == 'Maruti') & (df.Mileage > 25)]

    Brand  Year  Kms_Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28
4  Maruti  2012       10000   Mumbai       28

In [82]:
df.iloc[0:1][(df.Brand == 'Maruti') & (df.Mileage > 25)]

C:\Users\soura\AppData\Local\Temp\ipykernel_17008\4033366583.py:1: UserWarning: Boolean Series key will be reindexed to match DataFrame index.
  df.iloc[0:1][(df.Brand == 'Maruti') & (df.Mileage > 25)]

    Brand  Year  Kms_Driven     City  Mileage
0  Maruti  2012       50000  Gurgaon       28

## group by

In [83]:
df

      Brand  Year  Kms_Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [138]:
df.groupby(by = ['Brand','Year','City'],sort = True).Kms_Driven.sum()

Brand     Year  City
Hyundai   2014  Delhi        30000
          2016  Delhi        46000
Mahindra  2015  Delhi        25000
Maruti    2012  Gurgaon      50000
                Mumbai       10000
          2019  Ghaziabad    12000
Renault   2014  Mumbai       31000
Tata      2011  Mumbai       60000
          2018  Chennai      15000
Name: Kms_Driven, dtype: int64

## sort by year

In [84]:
df

      Brand  Year  Kms_Driven       City  Mileage
0    Maruti  2012       50000    Gurgaon       28
1   Hyundai  2014       30000      Delhi       27
2      Tata  2011       60000     Mumbai       25
3  Mahindra  2015       25000      Delhi       26
4    Maruti  2012       10000     Mumbai       28
5   Hyundai  2016       46000      Delhi       29
6   Renault  2014       31000     Mumbai       24
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

In [141]:
df.sort_values(by = ['Year','Brand'])

      Brand  Year  Kms_Driven       City  Mileage
2      Tata  2011       60000     Mumbai       25
0    Maruti  2012       50000    Gurgaon       28
4    Maruti  2012       10000     Mumbai       28
1   Hyundai  2014       30000      Delhi       27
6   Renault  2014       31000     Mumbai       24
3  Mahindra  2015       25000      Delhi       26
5   Hyundai  2016       46000      Delhi       29
7      Tata  2018       15000    Chennai       21
8    Maruti  2019       12000  Ghaziabad       24

## count values for brand

In [85]:
df['Brand'].value_counts(dropna=True,sort=True,ascending=True)

Mahindra    1
Renault     1
Hyundai     2
Tata        2
Maruti      3
Name: Brand, dtype: int64

In [86]:
# getting a percentage count is better than the normal count. By setting normalize=True
df['Brand'].value_counts(normalize =True)

Maruti      0.333333
Hyundai     0.222222
Tata        0.222222
Mahindra    0.111111
Renault     0.111111
Name: Brand, dtype: float64

In [162]:
#  bin continuous data into discrete intervals
df['Mileage'].value_counts(bins=3)

(26.333, 29.0]      4
(23.667, 26.333]    4
(20.991, 23.667]    1
Name: Mileage, dtype: int64

In [87]:
# 1. Loading the data from a csv file
df = pd.read_csv("Airlines.csv")

In [88]:
# 2. Shape of a dataframe
df.shape

(539383, 9)

In [89]:
# 3. Head and Tail of the data frame
df.head(n=10)

   id Airline  Flight AirportFrom AirportTo  DayOfWeek  Time  Length  Delay
0   1      CO     269         SFO       IAH          3    15     205      1
1   2      US    1558         PHX       CLT          3    15     222      1
2   3      AA    2400         LAX       DFW          3    20     165      1
3   4      AA    2466         SFO       DFW          3    20     195      1
4   5      AS     108         ANC       SEA          3    30     202      0
5   6      CO    1094         LAX       IAH          3    30     181      1
6   7      DL    1768         LAX       MSP          3    30     220      0
7   8      DL    2722         PHX       DTW          3    30     228      0
8   9      DL    2606         SFO       MSP          3    35     216      1
9  10      AA    2538         LAS       ORD          3    40     200      1

In [90]:
df.tail(n=10)

,id,Airline,Flight,AirportFrom,AirportTo,DayOfWeek,Time,Length,Delay
539373,539374,B6,480,LAX,BOS,5,1435,320,1
539374,539375,DL,2354,LAX,ATL,5,1435,255,0
539375,539376,FL,58,LAX,ATL,5,1435,250,0
539376,539377,B6,717,JFK,SJU,5,1439,220,1
539377,539378,B6,739,JFK,PSE,5,1439,223,1
539378,539379,CO,178,OGG,SNA,5,1439,326,0
539379,539380,FL,398,SEA,ATL,5,1439,305,0
539380,539381,FL,609,SFO,MKE,5,1439,255,0
539381,539382,UA,78,HNL,SFO,5,1439,313,1
539382,539383,US,1442,LAX,PHL,5,1439,301,1

In [91]:
df.head(5)

   id Airline  Flight AirportFrom AirportTo  DayOfWeek  Time  Length  Delay
0   1      CO     269         SFO       IAH          3    15     205      1
1   2      US    1558         PHX       CLT          3    15     222      1
2   3      AA    2400         LAX       DFW          3    20     165      1
3   4      AA    2466         SFO       DFW          3    20     195      1
4   5      AS     108         ANC       SEA          3    30     202      0